//
//  sandbox.h
//  darksword-kexploit-fun
//
//  Created by seo on 4/6/26.
//

struct lck_rw {
    uintptr_t opaque[2];
};

// Below structure code related sandbox is created/reversed by Claude AI, so might be inaccurate.
// FYI: Reversing kernelcache is ipad air m3(T8122)/18.3.x/DEVELOPMENT
struct extension {
    /* +0x00 */ struct extension *next;
    /* +0x08 */ uint64_t handle;             // -1 if not consumed
    /* +0x10 */ uint64_t inline_data[4];     // internal (zeros)
    
    /* +0x30 */ uint32_t refcnt;
    /* +0x34 */ uint8_t  type;               // 0=FILE, 1=STRING, ...
    /* +0x35 */ uint8_t  flags;
    /* +0x36 */ uint16_t _pad36;
    /* +0x38 */ void    *refgrp;             // os_ref group (can be NULL)

    /* +0x40 - type-dependent pointer */
    union {
        void    *data_ptr;                   // FILE:   path buffer kaddr
        void    *aux_ptr;                    // STRING: auxiliary pointer
    };

    /* +0x48 */
    union {
        uint64_t path_len;                   // FILE:   strlen(path)
        char    *ext_string;                 // STRING: extension string kaddr
    };

    /* +0x50 */
    union {
        struct {                             // FILE type
            uint8_t  consumed;               // +0x50
            uint8_t  storage_class;          // +0x51
            uint8_t  _pad52[2];              // +0x52
            uint32_t st_dev;                 // +0x54
        } file;
        uint64_t ext_string_len;             // STRING: strlen
    };

    /* +0x58 */ uint64_t st_ino;             // FILE: inode, STRING: 0
    /* +0x60 */ uint64_t _reserved;
    /* +0x68 */ struct extension *sc_prev;    // storage-class chain
    /* +0x70 */ struct extension *sc_next;
};

struct extension_sc_node {
    struct extension_sc_node *next;              // +0x00
    struct extension         *ext_sc_head;       // +0x08
    uint8_t              storage_class_id;  // +0x10
    uint8_t              _pad[7];           // +0x11
};

struct extension_class_node {
    struct extension_class_node *next;           // +0x00
    struct extension            *ext_list_head;  // +0x08
    char                   *class_name;     // +0x10
};

struct extension_set {
    struct extension_class_node *type_buckets[9];   // +0x00~+0x47 (9 × 8 = 72)
    struct extension_sc_node    *sc_buckets[9];     // +0x48~+0x8F (9 × 8 = 72)
    uint64_t                handle_counter;    // +0x90 (atomic)
    struct lck_rw                ext_lock;          // +0x98
    uint64_t                set_metadata_1;    // +0xA0
    uint64_t                set_metadata_2;    // +0xA8
};

struct sandbox_label {
    void               *profile;
    uint64_t            flags;
    struct extension_set    *extension_set;
    uint64_t            mem_usage;
    uint64_t            mem_limit;
    uint64_t            refcnt_area_1;
    uint64_t            refcnt_area_2;
    uint64_t            sb_flags2;
    uint64_t            sb_data1;
    uint64_t            sb_data2;
    uint64_t            capacity;
    void               *extra_ptr;
    uint64_t            sb_data3;
};

#define SC_ISSUED           0x02   /* sandbox_extension_issue_file */
#define SC_CONTAINER        0x07   /* app data container (/var/mobile/Containers/Data/...) */
#define SC_EXECUTABLE       0x0A   /* app bundle (/var/containers/Bundle/Application/...) */
#define SC_BYPASS           0xFF   /* IDK */

int patch_sandbox_ext(void);
int check_sandbox_var_rw(void);

// Below codes are taken from https://github.com/opa334/opainject/blob/main/sandbox.h
enum sandbox_filter_type {
    SANDBOX_FILTER_NONE,
    SANDBOX_FILTER_PATH,
    SANDBOX_FILTER_GLOBAL_NAME,
    SANDBOX_FILTER_LOCAL_NAME,
    SANDBOX_FILTER_APPLEEVENT_DESTINATION,
    SANDBOX_FILTER_RIGHT_NAME,
    SANDBOX_FILTER_PREFERENCE_DOMAIN,
    SANDBOX_FILTER_KEXT_BUNDLE_ID,
    SANDBOX_FILTER_INFO_TYPE,
    SANDBOX_FILTER_NOTIFICATION,
    // ?
    // ?
    SANDBOX_FILTER_XPC_SERVICE_NAME = 12,
    SANDBOX_FILTER_IOKIT_CONNECTION,
    // ?
    // ?
    // ?
    // ?
};


enum sandbox_extension_flags {
    FS_EXT_DEFAULTS =              0,
    FS_EXT_FOR_PATH =       (1 << 0),
    FS_EXT_FOR_FILE =       (1 << 1),
    FS_EXT_READ =           (1 << 2),
    FS_EXT_WRITE =          (1 << 3),
    FS_EXT_PREFER_FILEID =  (1 << 4),
};

extern const char * APP_SANDBOX_IOKIT_CLIENT;
extern const char * APP_SANDBOX_MACH;
extern const char * APP_SANDBOX_READ;
extern const char * APP_SANDBOX_READ_WRITE;

extern const char * IOS_SANDBOX_APPLICATION_GROUP;
extern const char * IOS_SANDBOX_CONTAINER;

extern const enum sandbox_filter_type SANDBOX_CHECK_ALLOW_APPROVAL;
extern const enum sandbox_filter_type SANDBOX_CHECK_CANONICAL;
extern const enum sandbox_filter_type SANDBOX_CHECK_NOFOLLOW;
extern const enum sandbox_filter_type SANDBOX_CHECK_NO_APPROVAL;
extern const enum sandbox_filter_type SANDBOX_CHECK_NO_REPORT;

extern const uint32_t SANDBOX_EXTENSION_CANONICAL;
extern const uint32_t SANDBOX_EXTENSION_DEFAULT;
extern const uint32_t SANDBOX_EXTENSION_MAGIC;
extern const uint32_t SANDBOX_EXTENSION_NOFOLLOW;
extern const uint32_t SANDBOX_EXTENSION_NO_REPORT;
extern const uint32_t SANDBOX_EXTENSION_NO_STORAGE_CLASS;
extern const uint32_t SANDBOX_EXTENSION_PREFIXMATCH;
extern const uint32_t SANDBOX_EXTENSION_UNRESOLVED;

int sandbox_check(pid_t, const char *operation, enum sandbox_filter_type, ...);
int sandbox_check_by_audit_token(audit_token_t, const char *operation, enum sandbox_filter_type, ...);
int sandbox_check_by_uniqueid(uid_t, pid_t, const char *operation, enum sandbox_filter_type, ...);

int64_t sandbox_extension_consume(const char *extension_token);
char *sandbox_extension_issue_file(const char *extension_class, const char *path, uint32_t flags);
char *sandbox_extension_issue_file_to_process(const char *extension_class, const char *path, uint32_t flags, audit_token_t);
char *sandbox_extension_issue_file_to_process_by_pid(const char *extension_class, const char *path, uint32_t flags, pid_t);
char *sandbox_extension_issue_file_to_self(const char *extension_class, const char *path, uint32_t flags);
char *sandbox_extension_issue_generic(const char *extension_class, uint32_t flags);
char *sandbox_extension_issue_generic_to_process(const char *extension_class, uint32_t flags, audit_token_t);
char *sandbox_extension_issue_generic_to_process_by_pid(const char *extension_class, uint32_t flags, pid_t);
char *sandbox_extension_issue_iokit_registry_entry_class(const char *extension_class, const char *registry_entry_class, uint32_t flags);
char *sandbox_extension_issue_iokit_registry_entry_class_to_process(const char *extension_class, const char *registry_entry_class, uint32_t flags, audit_token_t);
char *sandbox_extension_issue_iokit_registry_entry_class_to_process_by_pid(const char *extension_class, const char *registry_entry_class, uint32_t flags, pid_t);
char *sandbox_extension_issue_iokit_user_client_class(const char *extension_class, const char *registry_entry_class, uint32_t flags);
char *sandbox_extension_issue_mach(const char *extension_class, const char *name, uint32_t flags);
char *sandbox_extension_issue_mach_to_process(const char *extension_class, const char *name, uint32_t flags, audit_token_t);
char *sandbox_extension_issue_mach_to_process_by_pid(const char *extension_class, const char *name, uint32_t flags, pid_t);
char *sandbox_extension_issue_posix_ipc(const char *extension_class, const char *name, uint32_t flags);
void sandbox_extension_reap(void);
int sandbox_extension_release(int64_t extension_handle);
int sandbox_extension_release_file(int64_t extension_handle, const char *path);
int sandbox_extension_update_file(int64_t extension_handle, const char *path);
